teddokano/mcxa_p3t1755_test/board/pin_mux.h
/***********************************************************************************************************************
 * This file was generated by the MCUXpresso Config Tools. Any manual edits made to this file
 * will be overwritten if the respective MCUXpresso Config Tools is used to update this file.
 **********************************************************************************************************************/

#ifndef _PIN_MUX_H_
#define _PIN_MUX_H_

/*!
 * @addtogroup pin_mux
 * @{
 */

/***********************************************************************************************************************
 * API
 **********************************************************************************************************************/

#if defined(__cplusplus)
extern "C" {
#endif

/*!
 * @brief Calls initialization functions.
 *
 */
void BOARD_InitBootPins(void);

#define PCR_DSE_dse0 0x00u          /*!<@brief Drive Strength Enable: Low */
#define PCR_IBE_ibe1 0x01u          /*!<@brief Input Buffer Enable: Enables */
#define PCR_INV_inv0 0x00u          /*!<@brief Invert Input: Does not invert */
#define PCR_ODE_ode0 0x00u          /*!<@brief Open Drain Enable: Disables */
#define PCR_PE_pe0 0x00u            /*!<@brief Pull Enable: Disables */
#define PCR_PFE_pfe0 0x00u          /*!<@brief Passive Filter Enable: Disables */
#define PCR_PS_ps0 0x00u            /*!<@brief Pull Select: Enables internal pulldown resistor */
#define PCR_PV_pv0 0x00u            /*!<@brief Pull Value: Low */
#define PCR_SRE_sre0 0x00u          /*!<@brief Slew Rate Enable: Fast */
#define PORT2_PCR0_MUX_mux00 0x00u  /*!<@brief Pin Multiplex Control: Alternative 0 (GPIO) */
#define PORT2_PCR12_MUX_mux00 0x00u /*!<@brief Pin Multiplex Control: Alternative 0 (GPIO) */
#define PORT2_PCR13_MUX_mux00 0x00u /*!<@brief Pin Multiplex Control: Alternative 0 (GPIO) */
#define PORT2_PCR16_MUX_mux00 0x00u /*!<@brief Pin Multiplex Control: Alternative 0 (GPIO) */
#define PORT2_PCR4_MUX_mux00 0x00u  /*!<@brief Pin Multiplex Control: Alternative 0 (GPIO) */
#define PORT2_PCR5_MUX_mux00 0x00u  /*!<@brief Pin Multiplex Control: Alternative 0 (GPIO) */
#define PORT2_PCR6_MUX_mux00 0x00u  /*!<@brief Pin Multiplex Control: Alternative 0 (GPIO) */
#define PORT3_PCR30_MUX_mux00 0x00u /*!<@brief Pin Multiplex Control: Alternative 0 (GPIO) */
#define PORT3_PCR31_MUX_mux00 0x00u /*!<@brief Pin Multiplex Control: Alternative 0 (GPIO) */
#define PORT3_PCR7_MUX_mux101 0x05u /*!<@brief Pin Multiplex Control: Alternative 5 (chip-specific) */

/*! @name PORT3_12 (number 38), ARD_D5
  @{ */

/* Symbols to be used with GPIO driver */
#define BOARD_INITPINS_ARD_D5_GPIO GPIO3                /*!<@brief GPIO peripheral base pointer */
#define BOARD_INITPINS_ARD_D5_GPIO_PIN 12U              /*!<@brief GPIO pin number */
#define BOARD_INITPINS_ARD_D5_GPIO_PIN_MASK (1U << 12U) /*!<@brief GPIO pin mask */

/* Symbols to be used with PORT driver */
#define BOARD_INITPINS_ARD_D5_PORT PORT3                /*!<@brief PORT peripheral base pointer */
#define BOARD_INITPINS_ARD_D5_PIN 12U                   /*!<@brief PORT pin number */
#define BOARD_INITPINS_ARD_D5_PIN_MASK (1U << 12U)      /*!<@brief PORT pin mask */
                                                        /* @} */

/*! @name PORT3_13 (number 37), ARD_D6
  @{ */

/* Symbols to be used with GPIO driver */
#define BOARD_INITPINS_ARD_D6_GPIO GPIO3                /*!<@brief GPIO peripheral base pointer */
#define BOARD_INITPINS_ARD_D6_GPIO_PIN 13U              /*!<@brief GPIO pin number */
#define BOARD_INITPINS_ARD_D6_GPIO_PIN_MASK (1U << 13U) /*!<@brief GPIO pin mask */

/* Symbols to be used with PORT driver */
#define BOARD_INITPINS_ARD_D6_PORT PORT3                /*!<@brief PORT peripheral base pointer */
#define BOARD_INITPINS_ARD_D6_PIN 13U                   /*!<@brief PORT pin number */
#define BOARD_INITPINS_ARD_D6_PIN_MASK (1U << 13U)      /*!<@brief PORT pin mask */
                                                        /* @} */

/*! @name PORT1_8 (number 2), ARD_D18
  @{ */

/* Symbols to be used with GPIO driver */
#define BOARD_INITPINS_ARD_D18_GPIO GPIO1               /*!<@brief GPIO peripheral base pointer */
#define BOARD_INITPINS_ARD_D18_GPIO_PIN 8U              /*!<@brief GPIO pin number */
#define BOARD_INITPINS_ARD_D18_GPIO_PIN_MASK (1U << 8U) /*!<@brief GPIO pin mask */

/* Symbols to be used with PORT driver */
#define BOARD_INITPINS_ARD_D18_PORT PORT1               /*!<@brief PORT peripheral base pointer */
#define BOARD_INITPINS_ARD_D18_PIN 8U                   /*!<@brief PORT pin number */
#define BOARD_INITPINS_ARD_D18_PIN_MASK (1U << 8U)      /*!<@brief PORT pin mask */
                                                        /* @} */

/*! @name PORT3_31 (number 30), ARD_A4
  @{ */

/* Symbols to be used with GPIO driver */
#define BOARD_INITPINS_ARD_A4_GPIO GPIO3                /*!<@brief GPIO peripheral base pointer */
#define BOARD_INITPINS_ARD_A4_GPIO_PIN 31U              /*!<@brief GPIO pin number */
#define BOARD_INITPINS_ARD_A4_GPIO_PIN_MASK (1U << 31U) /*!<@brief GPIO pin mask */

/* Symbols to be used with PORT driver */
#define BOARD_INITPINS_ARD_A4_PORT PORT3                /*!<@brief PORT peripheral base pointer */
#define BOARD_INITPINS_ARD_A4_PIN 31U                   /*!<@brief PORT pin number */
#define BOARD_INITPINS_ARD_A4_PIN_MASK (1U << 31U)      /*!<@brief PORT pin mask */
                                                        /* @} */

/*! @name PORT3_30 (number 31), ARD_A5
  @{ */

/* Symbols to be used with GPIO driver */
#define BOARD_INITPINS_ARD_A5_GPIO GPIO3                /*!<@brief GPIO peripheral base pointer */
#define BOARD_INITPINS_ARD_A5_GPIO_PIN 30U              /*!<@brief GPIO pin number */
#define BOARD_INITPINS_ARD_A5_GPIO_PIN_MASK (1U << 30U) /*!<@brief GPIO pin mask */

/* Symbols to be used with PORT driver */
#define BOARD_INITPINS_ARD_A5_PORT PORT3                /*!<@brief PORT peripheral base pointer */
#define BOARD_INITPINS_ARD_A5_PIN 30U                   /*!<@brief PORT pin number */
#define BOARD_INITPINS_ARD_A5_PIN_MASK (1U << 30U)      /*!<@brief PORT pin mask */
                                                        /* @} */

/*! @name PORT1_9 (number 3), ARD_D19
  @{ */

