teddokano/mcxa_p3t1755_test/board/pin_mux.h
/* Symbols to be used with GPIO driver */
#define BOARD_INITPINS_ARD_D19_GPIO GPIO1               /*!<@brief GPIO peripheral base pointer */
#define BOARD_INITPINS_ARD_D19_GPIO_PIN 9U              /*!<@brief GPIO pin number */
#define BOARD_INITPINS_ARD_D19_GPIO_PIN_MASK (1U << 9U) /*!<@brief GPIO pin mask */

/* Symbols to be used with PORT driver */
#define BOARD_INITPINS_ARD_D19_PORT PORT1               /*!<@brief PORT peripheral base pointer */
#define BOARD_INITPINS_ARD_D19_PIN 9U                   /*!<@brief PORT pin number */
#define BOARD_INITPINS_ARD_D19_PIN_MASK (1U << 9U)      /*!<@brief PORT pin mask */
                                                        /* @} */

/*! @name PORT1_12 (number 6), ARD_A1
  @{ */

/* Symbols to be used with GPIO driver */
#define BOARD_INITPINS_ARD_A1_GPIO GPIO1                /*!<@brief GPIO peripheral base pointer */
#define BOARD_INITPINS_ARD_A1_GPIO_PIN 12U              /*!<@brief GPIO pin number */
#define BOARD_INITPINS_ARD_A1_GPIO_PIN_MASK (1U << 12U) /*!<@brief GPIO pin mask */

/* Symbols to be used with PORT driver */
#define BOARD_INITPINS_ARD_A1_PORT PORT1                /*!<@brief PORT peripheral base pointer */
#define BOARD_INITPINS_ARD_A1_PIN 12U                   /*!<@brief PORT pin number */
#define BOARD_INITPINS_ARD_A1_PIN_MASK (1U << 12U)      /*!<@brief PORT pin mask */
                                                        /* @} */

/*! @name PORT1_13 (number 7), ARD_A2
  @{ */

/* Symbols to be used with GPIO driver */
#define BOARD_INITPINS_ARD_A2_GPIO GPIO1                /*!<@brief GPIO peripheral base pointer */
#define BOARD_INITPINS_ARD_A2_GPIO_PIN 13U              /*!<@brief GPIO pin number */
#define BOARD_INITPINS_ARD_A2_GPIO_PIN_MASK (1U << 13U) /*!<@brief GPIO pin mask */

/* Symbols to be used with PORT driver */
#define BOARD_INITPINS_ARD_A2_PORT PORT1                /*!<@brief PORT peripheral base pointer */
#define BOARD_INITPINS_ARD_A2_PIN 13U                   /*!<@brief PORT pin number */
#define BOARD_INITPINS_ARD_A2_PIN_MASK (1U << 13U)      /*!<@brief PORT pin mask */
                                                        /* @} */

/*! @name PORT2_0 (number 14), ARD_A3
  @{ */

/* Symbols to be used with GPIO driver */
#define BOARD_INITPINS_ARD_A3_GPIO GPIO2               /*!<@brief GPIO peripheral base pointer */
#define BOARD_INITPINS_ARD_A3_GPIO_PIN 0U              /*!<@brief GPIO pin number */
#define BOARD_INITPINS_ARD_A3_GPIO_PIN_MASK (1U << 0U) /*!<@brief GPIO pin mask */

/* Symbols to be used with PORT driver */
#define BOARD_INITPINS_ARD_A3_PORT PORT2               /*!<@brief PORT peripheral base pointer */
#define BOARD_INITPINS_ARD_A3_PIN 0U                   /*!<@brief PORT pin number */
#define BOARD_INITPINS_ARD_A3_PIN_MASK (1U << 0U)      /*!<@brief PORT pin mask */
                                                       /* @} */

/*! @name PORT2_4 (number 18), ARD_D2
  @{ */

/* Symbols to be used with GPIO driver */
#define BOARD_INITPINS_ARD_D2_GPIO GPIO2               /*!<@brief GPIO peripheral base pointer */
#define BOARD_INITPINS_ARD_D2_GPIO_PIN 4U              /*!<@brief GPIO pin number */
#define BOARD_INITPINS_ARD_D2_GPIO_PIN_MASK (1U << 4U) /*!<@brief GPIO pin mask */

/* Symbols to be used with PORT driver */
#define BOARD_INITPINS_ARD_D2_PORT PORT2               /*!<@brief PORT peripheral base pointer */
#define BOARD_INITPINS_ARD_D2_PIN 4U                   /*!<@brief PORT pin number */
#define BOARD_INITPINS_ARD_D2_PIN_MASK (1U << 4U)      /*!<@brief PORT pin mask */
                                                       /* @} */

/*! @name PORT2_5 (number 19), ARD_D4
  @{ */

/* Symbols to be used with GPIO driver */
#define BOARD_INITPINS_ARD_D4_GPIO GPIO2               /*!<@brief GPIO peripheral base pointer */
#define BOARD_INITPINS_ARD_D4_GPIO_PIN 5U              /*!<@brief GPIO pin number */
#define BOARD_INITPINS_ARD_D4_GPIO_PIN_MASK (1U << 5U) /*!<@brief GPIO pin mask */

/* Symbols to be used with PORT driver */
#define BOARD_INITPINS_ARD_D4_PORT PORT2               /*!<@brief PORT peripheral base pointer */
#define BOARD_INITPINS_ARD_D4_PIN 5U                   /*!<@brief PORT pin number */
#define BOARD_INITPINS_ARD_D4_PIN_MASK (1U << 5U)      /*!<@brief PORT pin mask */
                                                       /* @} */

/*! @name PORT3_15 (number 35), ARD_D8
  @{ */

/* Symbols to be used with GPIO driver */
#define BOARD_INITPINS_ARD_D8_GPIO GPIO3                /*!<@brief GPIO peripheral base pointer */
#define BOARD_INITPINS_ARD_D8_GPIO_PIN 15U              /*!<@brief GPIO pin number */
#define BOARD_INITPINS_ARD_D8_GPIO_PIN_MASK (1U << 15U) /*!<@brief GPIO pin mask */

/* Symbols to be used with PORT driver */
#define BOARD_INITPINS_ARD_D8_PORT PORT3                /*!<@brief PORT peripheral base pointer */
#define BOARD_INITPINS_ARD_D8_PIN 15U                   /*!<@brief PORT pin number */
#define BOARD_INITPINS_ARD_D8_PIN_MASK (1U << 15U)      /*!<@brief PORT pin mask */
                                                        /* @} */

/*! @name PORT3_14 (number 36), ARD_D9
  @{ */

/* Symbols to be used with GPIO driver */
#define BOARD_INITPINS_ARD_D9_GPIO GPIO3                /*!<@brief GPIO peripheral base pointer */
#define BOARD_INITPINS_ARD_D9_GPIO_PIN 14U              /*!<@brief GPIO pin number */
#define BOARD_INITPINS_ARD_D9_GPIO_PIN_MASK (1U << 14U) /*!<@brief GPIO pin mask */

/* Symbols to be used with PORT driver */
#define BOARD_INITPINS_ARD_D9_PORT PORT3                /*!<@brief PORT peripheral base pointer */
#define BOARD_INITPINS_ARD_D9_PIN 14U                   /*!<@brief PORT pin number */
#define BOARD_INITPINS_ARD_D9_PIN_MASK (1U << 14U)      /*!<@brief PORT pin mask */
                                                        /* @} */

/*! @name PORT2_12 (number 22), ARD_D13
  @{ */

/* Symbols to be used with GPIO driver */
#define BOARD_INITPINS_ARD_D13_GPIO GPIO2                /*!<@brief GPIO peripheral base pointer */
#define BOARD_INITPINS_ARD_D13_GPIO_PIN 12U              /*!<@brief GPIO pin number */
#define BOARD_INITPINS_ARD_D13_GPIO_PIN_MASK (1U << 12U) /*!<@brief GPIO pin mask */

/* Symbols to be used with PORT driver */
#define BOARD_INITPINS_ARD_D13_PORT PORT2                /*!<@brief PORT peripheral base pointer */
#define BOARD_INITPINS_ARD_D13_PIN 12U                   /*!<@brief PORT pin number */
#define BOARD_INITPINS_ARD_D13_PIN_MASK (1U << 12U)      /*!<@brief PORT pin mask */
                                                         /* @} */

/*! @name PORT2_13 (number 23), ARD_D11
  @{ */

